CSI API ETABS v1
cPointObj.SetSelected Method
 Sets the selected status for a point object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSelected(
	string Name,
	bool Selected,
	eItemType ItemType = eItemType.Objects
)
Function SetSelected (
	Name As String,
	Selected As Boolean,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim Selected As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetSelected(Name,
	Selected, ItemType)
int SetSelected(
	String^ Name,
	bool Selected,
	eItemType ItemType = eItemType::Objects
)
abstract SetSelected :
        Name : string *
        Selected : bool *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing point object or group depending on the value of the ItemType item.
Selected
Type: System.Boolean
 This item is True if the specified point object is selected, otherwise it is False.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the selected status is set for the point object specified by the Name item.
 If this item is Group, the selected status is set for all point objects in the group specified by the Name item.
 If this item is SelectedObjects, the selected status is set for all selected point objects and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the selected status is successfully set, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value as Boolean()
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'set point selected
       ret = SapModel.PointObj.SetSelected("3", True)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPointObj Interface
ETABSv1 Namespace